       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANAGRAM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SUBJECT PIC X(20).
       01 WS-CANDIDATES-COUNT PIC 9.
       01 WS-CANDIDATES-TABLE.
           02 WS-CANDIDATES OCCURS 1 TO 9
                            DEPENDING ON WS-CANDIDATES-COUNT.
              05 WS-CANDIDATE PIC X(20).
       01 WS-RESULT-LIST PIC X(48).
       LOCAL-STORAGE SECTION.
       01 SUBJECT-LOWER PIC X(20).
       01 CANDIDATES-IX PIC 9.
       01 CANDIDATE PIC X(20).
       01 CANDIDATE-IX PIC 99.
       01 CANDIDATE-LENGTH PIC 99.
       01 TALLY-1 PIC 99.
       01 TALLY-2 PIC 99.
      
       PROCEDURE DIVISION.
       FIND-ANAGRAMS.
       MOVE FUNCTION LOWER-CASE(WS-SUBJECT) TO SUBJECT-LOWER.
       PERFORM VARYING CANDIDATES-IX FROM 1 BY 1 UNTIL CANDIDATES-IX > WS-CANDIDATES-COUNT
       MOVE FUNCTION LOWER-CASE(WS-CANDIDATES(CANDIDATES-IX)) TO CANDIDATE
       MOVE FUNCTION LENGTH(CANDIDATE) TO CANDIDATE-LENGTH
       IF CANDIDATE NOT = SUBJECT-LOWER THEN
          PERFORM VARYING CANDIDATE-IX FROM 1 BY 1 UNTIL CANDIDATE-IX > CANDIDATE-LENGTH
             INSPECT SUBJECT-LOWER TALLYING TALLY-1 FOR ALL CANDIDATE(CANDIDATE-IX:1)
             INSPECT CANDIDATE TALLYING TALLY-2 FOR ALL CANDIDATE(CANDIDATE-IX:1)
             IF TALLY-1 = TALLY-2 THEN
                STRING WS-RESULT-LIST "," WS-CANDIDATES(CANDIDATES-IX) DELIMITED BY SIZE INTO WS-RESULT-LIST
          END-PERFORM
         END-IF
       END-PERFORM.
       STOP RUN.
